{"newestBlock":18517905,"events":[{"blockNumber":18284867,"blockHash":"0x52fa0508a08470deb242aaac09b1ffacd879bbc3ad61c1ad7fdafb51199f3741","transactionIndex":90,"address":"0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","transactionHash":"0x28f80a09e07b961736bea2a0e3d575d25719ade30434c8e3cab83261cae54c1e","eventName":"ProposalUpdated","eventSignature":"ProposalUpdated(uint256,address,address[],uint256[],string[],bytes[],string,string)","id":394,"proposer":"0xffAF62026731607c5087a44BBa2CbCE1Fc908d99","targets":["0xd97Bcd9f47cEe35c0a9ec1dc40C1269afc9E8E1D"],"signatures":["sendOrRegisterDebt(address,uint256)"],"calldatas":["0x00000000000000000000000079095391743e0f017a16c388de6a6a3f175a5cd50000000000000000000000000000000000000000000000000000000861c46800"],"description":"# 🔥 The Burn: audit funding\n\nWe are planning to propose an upgrade that implements [The Burn](https://w.mirror.xyz/AmHOzH-FQZVO3IhGXHSvCRxRSf2MO6VCZdmMwNEIyKE). The goals for the burn are described in the blog post above by wilson.\n\nWhat's in this proposal text?\n\n* High level design details\n* Audit plan and budget request ($36K)\n\nThe burn code is in an advanced state, and if this proposal succeeds we hope to start the audit soon after.\n\n## Technical spec\n\nWe plan to deploy a new contract, with a single function that lets burn excess ETH from the timelock.\n\n### How much will be burned?\n\nExcess ETH is defined as the difference between the treasury value denominated in ETH, and: adjusted_total_supply * trailing_N_day_mean_auction_price.\n\nadjusted_total_supply is the number of minted nouns, excluding nouns held by the treasury or in the escrow contract.\n\nIn order to calculate the treasury value in ETH, the contract will consider only ETH, stETH, rETH & WETH. All other assets are ignored.\n\nThe number of auctions looked at when calculating the mean price is a configurable parameter; we suggest starting with 90.\n\nExample based on numbers close to actuals:\n\nTreasury has 2857 ETH, 10830 stETH, 228 rETH.\nAdjusted total supply: 394.\nMean price of last 90 auctions: 30 ETH.\nTreasury value in ETH: 2857 + 10830 + 247 (228 worth of rETH) = 13,934 ETH.\nExcess ETH: 13,934 - 30 * 394 = 2114 ETH.\n\n### What is burned?\n\nOnly ETH is burned. If the Nouns runs out of ETH, it will need to swap other assets (e.g. stETH) into ETH to allow for more burn.\n\n### When can it be called?\n\nThe goal is for the burn to happen at predictable times. One parameter will define what will be the first noun id at which the first burn can happen. Another parameter will define how many noun ids need to be minted before the next burn can happen.\n\nExample:\n\nSuppose the first noun id is set to 1000, and the number of nouns between burns is set to 100. The first burn will be possible once a noun with id 1000 is minted. The next burn would be possible once a noun with id 1100 is minted.\n\nEven if the first burn actually occurs when noun 1002 is auctioned, the next burn will still be possible starting id 1100.\n\n\n### Timelock upgrade\n\nThe timelock will be upgraded to a new version which will allow the burner contract to call it an burn ETH.\n\nThe timelock will only allow the burner contract to call it.\n\nThe address of the burner contract is a configurable param. Setting it to the zero address is effectively turning off the burn mechanism.\n\n\n## Audit costs\n\nOur plan is to undergo a deep code review with solimander, and an audit with [Sherlock](https://www.sherlock.xyz/). In a bit more detail:\n\n1. Soli review (+ verbs fix things)\n2. Sherlock audit\n3. Verbs fix things + soli reviews fixes\n4. Sherlock mitigation review\n\nWe are asking for 36K USDC to be sent to the Tech Grants Pod multisig to pay for the audit. 30K USDC will go to auditors and 6K USDC will go to Sherlock.\n\n## Next steps\n\nFunding the audit will let us know the DAO wants the burn to be deployed. Once funded we will finalize the code, undergo the audit, and follow up with a proposal to upgrade the auction house contract and the treasury contract.\n\nThe upgrade will leave the burn disabled, since it seems best to separate the deployment of the mechanism from reaching consensus on its parameters. We will of course support any voters who will want to follow up with a proposal to set the burn parameters.\n\nIt's also worthwhile for voters to consider converting stETH into ETH ahead of the burn, since as mentioned above this simple design only burns native ETH.\n\n## Appendix: pseudocode\n\nExcessETHBurner:\n\n```\n\n// configurable params:\n\nuint numPastAuctions;\n\nuint nextBurnNounId;\n\nuint mintsBetweenBurns;\n\nfunction burnExcessETH() {\n\n    if (auction().nounId &lt; nextBurnNounId) revert('Not yet');\n\n    \n\n    allowedTreasuryInETH = adjustTotalSupply() * meanAuctionPrice();\n\n    excessETH = treasuryValueInETH() - allowedTreasuryInETH;\n\n    amountToBurn = min(excessETH, timelock.balance);\n\n    \n\n    nextBurnNounId += mintsBetweenBurns;\n\n    \n\n    timelock.burnETH(amountToBurn);\n\n}\n\nfunction treasuryValueInETH() {\n\n    return timelock.balance + stETH.balanceOf(timelock) + \n\n        wETH.balanceOf(timelock) + rETH.getEthValue(rETH.balanceOf(timelock));\n\n}\n\nfunction meanAuctionPrice() {\n\n    return mean(auctionHouse.prices(numPastAuctions));\n\n}\n\n```\n\n\n## Appendix: current asset breakdown\n\nAt the time of writing this text, [according to Etherscan](https://etherscan.io/tokenholdings?a=0xb1a32FC9F9D8b2cf86C068Cae13108809547ef71):\n\n\n\n* Total treasury value is roughly $23.15M.\n* Its two main assets are:\n    * ETH at $4.391M (2631.493 ETH).\n    * stETH at $18.061M (10830.768 stETH).\n* These two assets alone make up over 96.7% of the total treasury value.\n* USDC is roughly 1.1% of the treasury, and we’re comfortable ignoring it for the sake of code simplicity.\n* wstETH is roughly 0.11% and is ignored as well.","updateMessage":"updated the audit budget to 36K due to a misunderstanding with Sherlock, and fixed the intro text"},{"blockNumber":18325349,"blockHash":"0x9b4389349970ab7235f2e5425179da1994fcdd56dc8b13af64bc648163863213","transactionIndex":95,"address":"0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","transactionHash":"0x3909fc860abb412a001e8f8bf64f0b0c47fed6d17c4764c3ad9b7f9ab8fe25a6","eventName":"ProposalUpdated","eventSignature":"ProposalUpdated(uint256,address,address[],uint256[],string[],bytes[],string,string)","id":406,"proposer":"0xDf6e59c6DF1E9500fd35A76FF4C62F9901E90019","targets":["0xd97Bcd9f47cEe35c0a9ec1dc40C1269afc9E8E1D"],"signatures":["sendOrRegisterDebt(address,uint256)"],"calldatas":["0x000000000000000000000000df6e59c6df1e9500fd35a76ff4c62f9901e900190000000000000000000000000000000000000000000000000000000cce416600"],"description":"# Sail Nouns: NFT NYC 2024\n\n## TL;DR\nGather the Nounish community on a big boat during NFT.NYC. The New York evening view from a sailboat is the best place to take photos while wearing Noggles.\n\n*Resubmission notes:\n- As per feedback on [Prop386](https://nouns.wtf/vote/386), I am resubmitting the proposal for NYC.NFT sailing event.\n- I reduced the budget that still can be enough for a classy gathering.\n- You can also mint photos from last event on ZORA*\n\n## Description\n![](https://hackmd.io/_uploads/HJjKkJqun.jpg)\nFollowing the success of [Prop 102](https://nouns.wtf/vote/102) and [Prop 173](https://nouns.wtf/vote/173), I would like to organize a sailing event on April 3rd in New York with the help of the Manhattan Yacht Club. IMO, it is important to gather at least once a year to celebrate achievements, brainstorm ideas, and share nounish goods. I believe New York is the best place for such gatherings. It was an amazing experience to meet everyone for the first time in person during NFT.NYC 2023. I think next year, we will have even more loyal nounish people visiting New York.\n\n## Burgee flag\nWe have a very beautiful flag with a meaning. *A white flag with red noggles symbolizes one noun! When you put many nouns burgee flags together, they symbolize the Nouns community.* The Nouns burgee flag debuted at the 2023 Nouns Sailing event during NFT.NYC, representing the spirit of Nouns and the tradition of the Nounish community. I would love to continue this tradition to distribute burgee flags at sailing event in NY.\n\n## Mint photos\n[MINT PHOTOS FROM NFTNYC2023 ON ZORA](https://zora.co/collect/zora:0x2d2505a06797a4b6a313c45e201d78834621e2b2)\n\n![](https://pink-feminist-vole-608.mypinata.cloud/ipfs/QmWfRcMcvTpAaa2KApVzY7vuwWxsDUriPF2TCpj9LJviDd)\n\n# Budget\n- **$18,000** Rent sail yacht Arabella\n- **$12,000** - Food and drinks by Manhattan Yacht Club\n- **$5,000** - 120 Nouns burgee flags\n- **$5,000** - 100 T-shirts (plus art by Messhup)\n- **$5,000** - Airfare and wage for Five\n- **$10,000** - Unexpected expenses (tax, crew allowance etc)\n\n**Subtotal: $55,000**\n\n# Person in Charge\nhttps://twitter.com/fiveoceans_dev\n![](https://hackmd.io/_uploads/SyyNHcn1p.png)","updateMessage":""},{"blockNumber":18380255,"blockHash":"0x1bf541b755cb8c28fff3ad54401af16758f28f1c3f595378c8a67fb5b7da1464","transactionIndex":145,"address":"0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","transactionHash":"0x8d64c41ddbd0e101a7044eac9f4dd5a7934951dd8f473e858163a2cc1e6c2087","eventName":"ProposalUpdated","eventSignature":"ProposalUpdated(uint256,address,address[],uint256[],string[],bytes[],string,string)","id":415,"proposer":"0xA86882277E69FbF0a51805cdc8b0a3a113079E63","targets":["0xae7ab96520DE3A18E5e111B5EaAb095312D7fE84","0x889edC2eDab5f40e902b864aD4d7AdE8E412F9B1"],"signatures":["approve(address,uint256)","requestWithdrawals(uint256[],address)"],"calldatas":["0x000000000000000000000000889edc2edab5f40e902b864ad4d7ade8e412f9b10000000000000000000000000000000000000000000000f3752521a9874c0000","0x0000000000000000000000000000000000000000000000000000000000000040000000000000000000000000b1a32fc9f9d8b2cf86c068cae13108809547ef71000000000000000000000000000000000000000000000000000000000000000500000000000000000000000000000000000000000000003635c9adc5dea0000000000000000000000000000000000000000000000000003635c9adc5dea0000000000000000000000000000000000000000000000000003635c9adc5dea0000000000000000000000000000000000000000000000000003635c9adc5dea0000000000000000000000000000000000000000000000000001a9dfe6a920ccc0000"],"description":"# Unstake 50% of stETH\n\nThe dao currently holds an outsized amount of stETH and requires more operational cash to keep funding proposals.\n\nI suggest we unstake and withdraw 50% of our [current stETH balance](https://etherscan.io/tokenholdings?a=0xb1a32FC9F9D8b2cf86C068Cae13108809547ef71), which is ~8982/2 = 4491 stETH.\n\n![](https://i.imgur.com/gpTs7eZ.png)\n\n#### **Transaction details**\nUnstaking from Lido is a [two-step process](https://stake.lido.fi/withdrawals/request). This proposal deals with step one.\n\n\n- Approve Withdrawal Queue to transfer 4491 stETH.\n- Request to withdraw 4491 stETH. The request is split into batches up to 1K ETH due to a Lido [withdrawal limit](https://etherscan.io/address/0x889edC2eDab5f40e902b864aD4d7AdE8E412F9B1#readProxyContract#F6).\n\n*Thanks to everyone for feedback, and to david, elad, and wiz for helping with this prop.*","updateMessage":"added a missing tx"},{"blockNumber":18441887,"blockHash":"0x9c22888f5cf1d8ba70068a12585f3b12f418946e8c90f9f5489f9dc88230752a","transactionIndex":85,"address":"0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","transactionHash":"0xf93e40f070aad10a4f538e03de99c934b00a454b2111be821550de89e2e2f913","eventName":"ProposalUpdated","eventSignature":"ProposalUpdated(uint256,address,address[],uint256[],string[],bytes[],string,string)","id":423,"proposer":"0x0C66d954d9cb1ebDF4E37a000262323C83655e70","targets":["0xd97Bcd9f47cEe35c0a9ec1dc40C1269afc9E8E1D"],"signatures":["sendOrRegisterDebt(address,uint256)"],"calldatas":["0x0000000000000000000000000c66d954d9cb1ebdf4e37a000262323c83655e700000000000000000000000000000000000000000000000000000001916668580"],"description":"# Onchain Myth - Updated.\n\n## **TL;DR:** \nI'm creating a graphic novel for readers who like sci-fi, and fantasy, integrating blockchain concepts and Nouns in a web3 world. Distribution will be digital and physical. The project development will be shared through videos, live streams, and Open Editions, aiming for completion in 10-12 months.\n\n---\n\n**UPDATE:**\nAfter some feedback I reduced the amount needed to execute this prop, just keeping strictly the necessary to make the graphic novel a reality and distribute it using the same methods. I have decreased the budget by 33%, going from 90 to 60 ETH, and swapped it to USDC.\n\n**About Noun 81:** I'm not including a txn to transfer the Noun inside the proposal.\nProf Werder is making a prop for that ([#421](https://nouns.wtf/vote/421)), I know it's a bit confusing, and it wasn't planned, but basically, if her prop passes I won't need an extra step to transfer the Noun, if not, I'll make a second prop to transfer the Noun to one of my wallets.\n\n---\n\n## **A Graphic Novel (Vol 1)**.\n![](https://hackmd.io/_uploads/BkNjEYyzT.png)\n*Draft Cover/Poster*\n\nI’m targeting Graphic Novel readers (15+) who love both sci-fi and fantasy + adventure, usually read action-packed stories, but also love tech, and (included but not limited) are crypto users. The artwork will include concepts related to decentralization, blockchain, and internet technologies, and Nouns will be the characters that inhabit this universe.\n\nI firmly believe that we can find the right audience in Web3 at first, it’s an amazing niche to build a tech-oriented story and ultimately an onchain mythology, in which Nouns could be not only at the core of it but represent great values and a positive-sum culture.\n\nTo me, nouns are not only pixel characters, but something more, they are storytelling vehicles full of potential. And at the same time, there are dozens of small elements in our community lore to include in the story. \n\n---\n\n## **Evolution of the Nouns aesthetics (from my POV):**\nWe all love the original Nouns, they are perfect as the source material, but they are also really adaptable to using them in different styles.\n![](https://hackmd.io/_uploads/HyPczHAWa.png)\n![](https://hackmd.io/_uploads/BJ-R9gHga.png)\n*The last two images are from April-June 2022.*\n\n In this world-building adventure, I've given the term \"Noun\" a fresh perspective, digging into its meaning both on the surface and at a deeper, symbolic level. This project isn't just about testing how Nouns look; it's also about spinning an engaging tale. We want to hook current Noun fans and introduce new readers to our world, even if they're not blockchain or DAO experts.\n \n---\n\n## **Distribution:**\n![](https://hackmd.io/_uploads/rJE-Pclfa.png)\nDraft Cover.\n\n**Digital First:**\nThe main distribution strategy will be online (Free download from the website, manga/comic reader apps like Comixology, Viz Media, Kindle, and P2P/torrents).\nMost of the dedicated comic reader apps have more than 500K users minimum, but in the case of bigger apps like Comixology or Viz Media, they have millions of users combined in both the App Store and Google Store.\n\n**Physical:**\nPhysical copies will be handled through Amazon (highly efficient, global coverage, and no upfront costs). Plus, in case we can make a deal with regional publishers, it's easy to shut down the distribution of a translated version directly on Amazon.\n\n\n**2 Languages:**\nEnglish, Spanish. \n\nSince the previous prop didn't pass I'm just including 2 languages.\nWhy? Because I'm a native Spanish speaker and I usually make the story, script and most of the other elements in my own language, sure, I can use English to make everything but it's not the same and it's slower for me to work that way.\n\n---\n\n## **Concept Art:**\n\n![](https://hackmd.io/_uploads/rJoFWSRZT.png)\n\n![](https://hackmd.io/_uploads/SJYtXrR-a.png)\n\n---\n## **Summary of the story (subject to changes):**\n\n\nMeet Shady, a Noun who doesn't quite fit the mold of an obedient or exemplary citizen in a world teeming with adventurers, mysteries, and high achievers. His existence is a quiet rebellion in a society that prizes conformity. However, it seems destiny, if it exists, has grander designs for Shady. His insatiable curiosity catapults him into the uncharted territories of unexplored worlds.\n\nAs Shady embarks on this enigmatic journey, it becomes clear that more than just his life is at stake. The fate of his entire kind rests on his shoulders, and time is of the essence. He's faced with a dilemma: will he seize this opportunity to change the course of history or let it slip through his fingers?\n\n\n\n## **Sample Pages**\n![](https://hackmd.io/_uploads/ryDRkBRWp.png)\n\n\n## **Characters from the first volume:**\n![](https://hackmd.io/_uploads/Bk-7xu1zp.png)\n\n**Featuring the NounBots:**\n\n![](https://hackmd.io/_uploads/rJVbJ9xza.png)\n![](https://hackmd.io/_uploads/S1nzkqeMa.png)\n![](https://hackmd.io/_uploads/SkRmycgM6.png)\n\n---\n\n## **Building in Public + Key Milestones:**\n\nI’m also building a graphic style to present the development of the project to the public in a more entertaining way using videos and/or live streams. This way people can follow more closely the development of the graphic novel and can ask questions about nouns and their ecosystem.\n\nThe goal is to make 2 videos per week, showing the process of the Graphic Novel, the idea is to use Twitch/YouTube, or short format videos like TikTok/Instagram.\nI can also use propdates.wtf to show the latest news of the prop and the Manga channel in Farcaster.\n\n![](https://hackmd.io/_uploads/SyO0trwWa.png)\n*This is a sample of how the videos could look like*.\n\n## **Key Milestones:**\n\n**Concept and Team (Months 1-3):**\nDevelop the storyline and artistic style.\n\n**Production and Marketing (Months 4-10):**\nCreate the 64-page graphic novel while making the videos.\nImplement marketing and promotion strategies on online platforms.\n\n**Distribution and Launch (Month 11-12):**\nPlan and execute the distribution strategy for both digital and physical copies.\nOfficially launch the graphic novel, including online and potentially in-person events.\n\n**Audience Engagement and Public Building (Ongoing):**\nContinuously engage with the community on various platforms, and introduce the videos to make updates about the progress of the Graphic Novel.\n\n**Global Expansion and Future Planning (Ongoing):**\nStart the conversations with external publishers to get the graphic novel printed around the globe.\nEvaluate the project's performance and plan for the next chapters.\n\n---\n\n## **Scope and Budget**:\nSince this is a graphic novel of 64 pages I will need around 10 to 12 months to finish it.\nThe ideal deadline would be the next Nouniversary and I’ll push myself and the team involved to do so, but I’m organizing the dates including all the team efforts and the standard timeframes to make the deadline more realistic so it could be released in October/November next year.\n\n---\n\n## **Budget Breakdown:**\n\n- **Preproduction - 7 eth**\n  - World Building\n  - Concept art \n  - Environment design\n  - Character Sheets\n  - Props Design \n- **Script - 7 eth**\n- **Art Development - 29 eth**\n  - Layouts - 6 eth\n  - Pencils - 8 eth\n  - Inks + Screentones - 11 eth\n  - Lettering + VFX/SFX - 4 eth\n- **Editorial - 4 eth**\n  - Proofreading and formatting for Spanish* and English.\n*Spanish is added because I'm writing this in my native language.\n- **Marketing and Distribution - 6 eth**\n  - Distribution through the mentioned apps and websites.\n  - Promoted content inside specialized comic websites/forums.\n  - Videos / Live Streams, to engage with the community.\n  - Web3 collectibles like Open Editions to promote the artwork.\n- **Management - 5 eth.**\n- **Website - 2 eth**\n### **Total= 60 ETH (USDC 107,750) + Noun 81**\n\n---\n\n## **It's a me, Messhup!**\nFor some of you who don't know me, let me introduce myself.\n\n![](https://hackmd.io/_uploads/Syxp3uJfa.jpg)\n\nMy name is Messhup and I:\n* Coined the rubber hose style on Nouns [back in 2021](https://x.com/messhup/status/1468248915963265024?s=20).\n* Created the art for the [1st contest made by NounsDAO](https://x.com/undeadnoun22/status/1473463987014619138?s=20).\n* [Lost Nouns](https://lostnouns.wtf/) founding team (Onchain Nounish derivative).\n* Made the 1st Nouniversary artwork ([featured in Brave browser globally for 24H](https://x.com/messhup/status/1568715950307905539?s=20)).\n* Constructed a coloring book series ([100 days of Nouns](https://nounsense.xyz/)) in 6 months. around 260 copies sold, and 1300 downloads, which served as the main source for several contests and attracted more artists.\n* Sent the coloring books to [DesignerCon 2022](https://x.com/bigshottoyworks/status/1711235066720821657?s=20) and [Devcon Bogota](https://x.com/messhup/status/1573013727200305156?s=20).\n* Nouncil founding member ([POAP](https://x.com/messhup/status/1514437218370215938?s=20)).\n* Made [The MetaSquare](https://x.com/thenounsquare/status/1620013926049288192?s=20) for TNS.\n* Helped to raise [21+ ETH](https://juicebox.money/p/sharkfrens) to support a [Shark DAO core member](https://x.com/sharkdao/status/1487436616557809670?s=20).\n* Drew 26 covers for the [Noun O Talk podcast](https://open.spotify.com/show/3zRdJbEHThDE8F5ODRnWMF).\n* Illustrated a NounsDAO banner for the [Coincenter dinner](https://x.com/apenoun/status/1535063255148003328?s=20).\n* Designed merch for a boat, pin, and tshirts for [Nouns at NFT NYC](https://x.com/fiveoceans_dev/status/1649095323988660224?s=20).\n* Created GGBot, and a current collaborator in Nouns Esports (more coming soon).\n* Made the art for [Keep Nouns Weird](https://x.com/keepnounsweird/status/1687503577667846144?s=20).\n* Created a Nounish collection called [Serial Collectors](https://opensea.io/collection/serialcollectors) (more to come).\n* Core member of [Nouns Amigos](https://x.com/NounsDAOAmigos/status/1668349764440825857?s=20) (spanish branch of Nouns)\n\n**Outside of Nouns:**\n* Collaborated with [Noadz](https://x.com/thenoadz/status/1550372389313122304?s=20) multiple times.\n* One of the first Nouns artwork in [another blockchain](https://x.com/NervosNetwork/status/1522231419921178625?s=20)*\n* Meme Seizer OE ([17K+ mints](https://opensea.io/collection/memeseizer-by-messhup)) + [Onchain narrative](https://opensea.io/collection/meme-seizer).\n* 1st Cryptoadz anniversary on Zora ([13,660+ mints](https://x.com/messhup/status/1569704877474848772?s=20)).\n* 1st Boneyversary OE ([4,700+ mints](https://opensea.io/collection/boneyversary)).\n* [POAP Checks](https://x.com/poapxyz/status/1623071331733364741?s=20) (1100+ mints in less than 2 hours).\n* Featured in the [NFT yearbook](https://x.com/nft_yearbook/status/1600486785582338049?s=20).\n* Worked with Bankless for 7 months as an illustrator.\n\nI also worked with Adidas, ExxonMobil, Penguin Random House, LEGO, and more to come.\n\nI have more than 10 years as an illustrator and I feel confident executing this project because I've been preparing this for around a year now, I'm here to stay, I'm aiming high with this prop, and I want to make an epic graphic novel that breaks into the mainstream media. Let's do it together 🔥\n\n---\n**Got Questions?**\nI have a separate doc highlighting some of the possible questions I could receive for this prop and will update the doc during the voting period. Feel free to check them out **[HERE](https://hackmd.io/JmagYev8T0Wx06eOe0hCKw)**.\n\nYou can also find me on Farcaster, Discord, and Twitter as @Messhup.\nThanks for reading, have a good one ᛉ \n","updateMessage":"Thanks for all the feedback! Hope this version of the prop is more suitable for the DAO ⌐◨-◨"},{"blockNumber":18441931,"blockHash":"0x70e9dc35b2353489eee7e272ba8c1d6cdae96cbc55f515c1721ebe0f39ad06fa","transactionIndex":149,"address":"0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","transactionHash":"0x406082938e9ffe88d99e30c2d85b8511146caf6885cb7febdc157ecd14b4d4eb","eventName":"ProposalUpdated","eventSignature":"ProposalUpdated(uint256,address,address[],uint256[],string[],bytes[],string,string)","id":422,"proposer":"0xb0dd496FffFa300df1EFf42702066aCa81834404","targets":["0x9C8fF314C9Bc7F6e59A9d9225Fb22946427eDC03","0x9C8fF314C9Bc7F6e59A9d9225Fb22946427eDC03","0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","0xcB06bEDe7cB0a4b333581B6BdcD05f7cc737b9cC"],"signatures":["safeTransferFrom(address,address,uint256)","safeTransferFrom(address,address,uint256)","withdrawDAONounsFromEscrowIncreasingTotalSupply(uint256[],address)",""],"calldatas":["0x000000000000000000000000b1a32fc9f9d8b2cf86c068cae13108809547ef71000000000000000000000000d94f65a9bfa4fcb04ffbc0a64687667fcb28110e00000000000000000000000000000000000000000000000000000000000002df","0x000000000000000000000000b1a32fc9f9d8b2cf86c068cae13108809547ef71000000000000000000000000d94f65a9bfa4fcb04ffbc0a64687667fcb28110e00000000000000000000000000000000000000000000000000000000000001c8","0x0000000000000000000000000000000000000000000000000000000000000040000000000000000000000000d94f65a9bfa4fcb04ffbc0a64687667fcb28110e0000000000000000000000000000000000000000000000000000000000000001000000000000000000000000000000000000000000000000000000000000014e","0x"],"description":"# Nouner Scout Rounds\n\n*tldr: \nExperiment with Prop House as a way to bring in long-term aligned players by running **three rounds** where the award is one Noun.*\n\n\n\n![image](https://i.imgur.com/qUW9UMk.png)\n\nPost-fork, the main goal for Nouns has been to create a stable environment where the auction attracts long-term aligned participants rather than arbitrageurs. The strategy includes increasing thoughtful spending, [testing out new mechanisms](https://w.mirror.xyz/AmHOzH-FQZVO3IhGXHSvCRxRSf2MO6VCZdmMwNEIyKE), and [rewarding Nouns to deserving contributors](https://www.nouns.camp/proposals/409).\n\nTo advance this goal, I suggest conducting trial rounds where a Noun is awarded through a Prop House round. The rounds' focus would be to bring in exceptional people who have previously contributed something meaningful in their respective fields. **Taking inspiration from [Brian Armstrong](https://twitter.com/brian_armstrong/status/1681439056323051529), the round would serve as an explicit invitation for accomplished and interesting individuals to help steward Nouns.** \n\n\n**Round parameters:**\n- A two-week period for submitting proposals.\n- A one-week period for voting.\n- Open submission for all (with basic criteria to avoid spam).\n- Voting conducted by Nouns voters.\n- The proposer with the highest votes receives one Noun.\n\nAfter round 1, round parameters will be adjusted if it makes sense to do so.\n\n**Logistics:**\nThe nouns would be escrowed in a [2/3 safe](https://etherscan.io/address/0xDBDD666BFa569F72866Fba319271aC008B6bbe7a) managed by trusted community members [ccarella](https://twitter.com/ccarella), [necfas](https://twitter.com/necfas) and [seneca](https://twitter.com/cryptoseneca). \n\n**Timeline:**\nIf we stick to a ~20 day timeline, we can run three rounds between November and December with the final round ending on new years day :)\n\n**The Chosen Ones:**\nArmy Pickel, Icy Snowman, Fiery Cloud\n\n![image](https://i.imgur.com/CjYhViX.png)\n\n**Nouns Spotlight Art**\nI've added a 0.25 ETH payment to [matascup](https://twitter.com/matascup) for making the Spotlight character for the Nouner Scout rounds.\n\n![image](https://i.imgur.com/036tNN9.png)\n\n---\n\nIf the experiment is successful in attracting worthy participants, we could consider running continuous rounds to help allocate the 500+ Nouns in the treasury. Worth noting is that if it is indeed a success, more than helping allocate Nouns, these rounds could be a sort of Nouns-wide celebration akin to noun-o-clock.","updateMessage":"add matas payment tx"},{"blockNumber":18444009,"blockHash":"0xeb693b529ad76e38d82f40cdcf2dc3ad450134423102ce69780e6a6278270f28","transactionIndex":128,"address":"0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","transactionHash":"0x30513c7aeeadda962043f2a7f50f87e60a37a7d518390cb3a316623534eefaad","eventName":"ProposalUpdated","eventSignature":"ProposalUpdated(uint256,address,address[],uint256[],string[],bytes[],string,string)","id":422,"proposer":"0xb0dd496FffFa300df1EFf42702066aCa81834404","targets":["0x9C8fF314C9Bc7F6e59A9d9225Fb22946427eDC03","0x9C8fF314C9Bc7F6e59A9d9225Fb22946427eDC03","0x6f3E6272A167e8AcCb32072d08E0957F9c79223d","0xcB06bEDe7cB0a4b333581B6BdcD05f7cc737b9cC","0xb0dd496FffFa300df1EFf42702066aCa81834404"],"signatures":["safeTransferFrom(address,address,uint256)","safeTransferFrom(address,address,uint256)","withdrawDAONounsFromEscrowIncreasingTotalSupply(uint256[],address)","",""],"calldatas":["0x000000000000000000000000b1a32fc9f9d8b2cf86c068cae13108809547ef71000000000000000000000000d94f65a9bfa4fcb04ffbc0a64687667fcb28110e00000000000000000000000000000000000000000000000000000000000002df","0x000000000000000000000000b1a32fc9f9d8b2cf86c068cae13108809547ef71000000000000000000000000d94f65a9bfa4fcb04ffbc0a64687667fcb28110e00000000000000000000000000000000000000000000000000000000000001c8","0x0000000000000000000000000000000000000000000000000000000000000040000000000000000000000000d94f65a9bfa4fcb04ffbc0a64687667fcb28110e0000000000000000000000000000000000000000000000000000000000000001000000000000000000000000000000000000000000000000000000000000014e","0x","0x"],"description":"# Nouner Scout Rounds\n\n*tldr: \nExperiment with Prop House as a way to bring in long-term aligned players by running **three rounds** where the award is one Noun.*\n\n\n\n![image](https://i.imgur.com/qUW9UMk.png)\n\nPost-fork, the main goal for Nouns has been to create a stable environment where the auction attracts long-term aligned participants rather than arbitrageurs. The strategy includes increasing thoughtful spending, [testing out new mechanisms](https://w.mirror.xyz/AmHOzH-FQZVO3IhGXHSvCRxRSf2MO6VCZdmMwNEIyKE), and [rewarding Nouns to deserving contributors](https://www.nouns.camp/proposals/409).\n\nTo advance this goal, I suggest conducting trial rounds where a Noun is awarded through a Prop House round. The rounds' focus would be to bring in exceptional people who have previously contributed something meaningful in their respective fields. **Taking inspiration from [Brian Armstrong](https://twitter.com/brian_armstrong/status/1681439056323051529), the round would serve as an explicit invitation for accomplished and interesting individuals to help steward Nouns.** \n\n\n**Round parameters:**\n- A two-week period for submitting proposals.\n- A one-week period for voting.\n- Open submission for all (with basic criteria to avoid spam).\n- Voting conducted by Nouns voters.\n- The proposer with the highest votes receives one Noun.\n\nAfter round 1, round parameters will be adjusted if it makes sense to do so.\n\n**Logistics:**\nThe nouns would be escrowed in a [2/3 safe](https://etherscan.io/address/0xDBDD666BFa569F72866Fba319271aC008B6bbe7a) managed by trusted community members [ccarella](https://twitter.com/ccarella), [necfas](https://twitter.com/necfas) and [seneca](https://twitter.com/cryptoseneca). \n\n**Timeline:**\nIf we stick to a ~20 day timeline, we can run three rounds between November and December with the final round ending on new years day :)\n\n**The Chosen Ones:**\nArmy Pickel, Icy Snowman, Fiery Cloud\n\n![image](https://i.imgur.com/CjYhViX.png)\n\n**Nouns Spotlight Art**\nI've added a 0.25 ETH payment to [matascup](https://twitter.com/matascup) for making the Spotlight character for the Nouner Scout rounds.\n\n![image](https://i.imgur.com/036tNN9.png)\n\n**Other:**\nI also added a 2.5 ETH tx to use for discretionary spending to make the experience legitimate. Current line of thinking is to use the funds to get someone to help me build a [dedicated Nouner Scout app](https://warpcast.com/seneca/0xdaabe6b4). If the funds are not used for whatever reason, they will be returned to the treasury. \n\n---\n\nIf the experiment is successful in attracting worthy participants, we could consider running continuous rounds to help allocate the 500+ Nouns in the treasury. Worth noting is that if it is indeed a success, more than helping allocate Nouns, these rounds could be a sort of Nouns-wide celebration akin to noun-o-clock.","updateMessage":"add discretionary spend tx"}]}